{
  "workExperiences": [
    {
      "title": "Sr. Software Engineer",
      "company": "Liberty Mutual Insurance",
      "duration": "Jun 2022 - Jun 2024",
      "logo": "./assets/lm-logo.webp",
      "challenges": [
        "Inconsistent UI implementations across various departments and projects due to diverse technology stacks (React, Angular, Vue.js, Vanilla JavaScript).",
        "Evolving brand identity and UI design over time, leading to further discrepancies in the user experience across different applications.",
        "Lack of a centralized system to manage and maintain Liberty Mutual's brand identity and UI standards efficiently."
      ],
      "solutions": [
        "Designed and developed an in-house, centralized UI library using agnostic and native web component technology (StencilJS).",
        "Ensured broad compatibility and support across various frontend frameworks (React, Angular, Vue, and plain JavaScript) by leveraging web components.",
        "Streamlined the UI development process, ensuring consistency in look and feel across all company-wide applications and projects."
      ],
      "contributions": [
        "Designed and built multiple core web components for the company-wide UI library, ensuring reusability and adherence to brand guidelines.",
        "Spearheaded the development of the widely adopted stepper component, which significantly improved user flows in various applications.",
        "Contributed to establishing a more consistent and unified user experience across Liberty Mutual's diverse digital products."
      ],
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "StencilJS",
        "Vue",
        "Angular",
        "React",
        "Node",
        "Material-UI",
        "Tailwind",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "Kanban",
        "Web Components",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Avaya",
      "duration": "Jun 2021 - May 2022",
      "challenges": [
        "Initial design system implemented as a basic CSS file, lacking comprehensive HTML structures and leading to inconsistent UI patterns.",
        "Significant difficulty in adhering to Web Content Accessibility Guidelines (WCAG) due to the absence of structured HTML implementations.",
        "Increased development time and diverted focus from core business logic as developers struggled with manual accessibility implementation and testing.",
        "Challenges in ensuring consistent color contrast, proper heading structures, clear link text, and correct ARIA attribute usage across various projects."
      ],
      "solutions": [
        "Developed a robust React-based UI component library, integrating accessibility standards (A11Y) directly into component design.",
        "Provided developers with pre-built, accessible components, significantly accelerating the development process.",
        "Ensured consistent compliance with WCAG guidelines across all applications, reducing the burden on individual development teams."
      ],
      "contributions": [
        "Designed and built several key components for the React UI library, embedding accessibility best practices from the ground up.",
        "Contributed to establishing a scalable and accessible design system that improved developer efficiency and product quality.",
        "Mentored junior developers on accessibility best practices and the effective use of the new UI component library."
      ],
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "Tailwind",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Leuchter IT Solutions",
      "duration": "Jun 2020 - May 2021",
      "challenges": [
        "Developing a comprehensive real estate and financing website for Swiss citizens, requiring complex loan financing calculations.",
        "Implementing a detailed application form for loan approvals, necessitating document uploads and secure data handling.",
        "Integrating a reliable system to retrieve zip codes based on specific cantons and property addresses in Switzerland.",
        "Ensuring the website was fully responsive and adaptable to various screen sizes and device resolutions."
      ],
      "solutions": [
        "Implemented the frontend using Material UI, coupled with a C# .NET and MSSQL backend for robust data management.",
        "Ensured full responsiveness across various screen sizes and device resolutions to provide a seamless user experience.",
        "Integrated multi-language support (English, German, Italian, and French) to cater to Switzerland's diverse linguistic population."
      ],
      "contributions": [
        "Developed new features for the platform, enhancing user engagement and functionality.",
        "Designed and implemented the financial calculator based on detailed design specifications, providing accurate loan estimates.",
        "Integrated a Swiss API for real-time zip code retrieval, improving the accuracy and efficiency of property searches."
      ],
      "skills": [
        "C#",
        ".Net",
        "SQL",
        "MS-SQL-Server",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Software Engineer",
      "company": "Joinder",
      "duration": "Jan 2020 - Jun 2020",
      "challenges": [
        "Developing a novel, custom cloud-based system for legal document management for the law firm Orrick, a solution not yet available in the market.",
        "Implementing a seamless and automatic document saving feature to eliminate the need for manual saves by users.",
        "Ensuring data integrity and cloud synchronization while handling real-time document edits."
      ],
      "solutions": [
        "Developed a cross-platform desktop application using Electron, providing a native-like user experience.",
        "Utilized Material UI for the frontend design, ensuring a modern and intuitive user interface.",
        "Leveraged C# .NET for the backend infrastructure, providing a robust and secure foundation for document management."
      ],
      "contributions": [
        "Implemented an innovative automatic document saving feature by leveraging Electron's file system privileges.",
        "Designed and developed a mechanism to detect real-time document changes and automatically upload updated versions to the cloud, significantly enhancing user workflow and data security.",
        "Contributed to the overall architecture and implementation of the Joinder application, ensuring its stability and performance."
      ],
      "skills": [
        "C#",
        ".Net",
        "Electron",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Pura",
      "duration": "Jan 2018 - May 2019",
      "challenges": [
        "Addressing common challenges faced by an early-stage startup, including rapidly scaling e-commerce functionality.",
        "Correcting a critical bug in the subscription model where the device was being incorrectly included in recurring subscription charges instead of only the initial purchase.",
        "Resolving inconsistencies in the mobile shopping cart's drag-and-drop functionality, where user actions outpaced server responses, leading to misaligned order displays."
      ],
      "solutions": [
        "Built the core e-commerce website using Shopify for initial online presence and sales.",
        "Leveraged React and Material-UI for enhanced frontend functionality and scalability.",
        "Utilized Firebase (as part of Google for Startups) for robust backend services, ensuring efficient data management and real-time updates."
      ],
      "contributions": [
        "Successfully fixed a critical bug in the subscription model, ensuring devices were charged only once at initial purchase, optimizing recurring revenue for fragrances.",
        "Implemented an **Optimistic UI** approach for the mobile shopping cart, providing immediate visual feedback to users and significantly improving the drag-and-drop experience by synchronizing client-side actions with server updates.",
        "Played a key role in developing and optimizing the e-commerce platform, contributing to Pura's growth as a startup."
      ],
      "skills": [
        "Firebase",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Infinity ELS",
      "duration": "Jan 2017 - Apr 2018",
      "challenges": [
        "Modernizing an outdated internal tool used for customer information and billing management.",
        "Addressing issues caused by a mixed jQuery and React codebase, which led to DOM manipulation inconsistencies and project instability.",
        "Leading the complete migration from a legacy jQuery implementation to a modern React-based frontend."
      ],
      "solutions": [
        "Initiated and led the migration from jQuery to React with Material UI, establishing a more modern and maintainable frontend architecture.",
        "Addressed immediate problems by modifying existing jQuery code to stabilize the application while planning the full migration.",
        "Successfully transitioned the entire project to a pure React codebase, eliminating inconsistencies and improving overall efficiency."
      ],
      "contributions": [
        "Identified and addressed critical DOM manipulation inconsistencies arising from the mixed jQuery and React codebase.",
        "Led the strategic decision and execution to fully remove all jQuery implementations, resulting in a cleaner and more efficient codebase.",
        "Mentored team members on React best practices, contributing to a more skilled and cohesive development team."
      ],
      "skills": [
        "jQuery",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Tech Lead",
      "company": "Google",
      "duration": "Feb 2013 - Dec 2016",
      "challenges": [
        "Addressing the critical challenge of Flash-based ads being incompatible with mobile devices (iPhones, iPads) in the early 2010s, as mobile usage surged.",
        "Facilitating the industry-wide shift from Flash to HTML5 and JavaScript to ensure broad ad reach across all platforms.",
        "Providing comprehensive technical support and migration assistance to digital marketing agencies across diverse linguistic regions (LATAM and NAM)."
      ],
      "solutions": [
        "Supported digital marketing agencies in Latin America (LATAM) and North America (NAM) in migrating their ad content from Flash to HTML5 and JavaScript.",
        "Provided multi-language support (English, Portuguese, and Spanish) to ensure a smooth and effective transition for diverse teams.",
        "Developed and launched an experimental Google Tech Ad Advertising prototype, demonstrating innovative ad capabilities."
      ],
      "contributions": [
        "Developed and launched `HTML5 Local Connect`, an experimental Google Tech Ad Advertising prototype that enabled two advertisements to interact dynamically.",
        "Showcased the potential of HTML5 and JavaScript for creating engaging and interactive ad experiences.",
        "Played a pivotal role in accelerating the adoption of modern web technologies for advertising, impacting a large number of digital marketing campaigns."
      ],
      "skills": [
        "Flash",
        "ActionScript",
        "HTML",
        "CSS",
        "JavaScript",
        "Google Cloud Platform",
        "Google Marketing Platform",
        "Google Campaign Manager 360",
        "Google Ad Manager",
        "Google Web Designer",
        "Google Ads Creative Studio",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Flex Developer",
      "company": "ProKarma",
      "duration": "Jun 2011 - Sep 2012",
      "challenges": [
        "Leading the adoption and effective use of the Adobe Flex framework within development projects.",
        "Conducting extensive code refactoring to transition legacy Adobe Flash ActionScript 3.0 codebases to Adobe Flex 4.0, aiming for improved efficiency and maintainability."
      ],
      "solutions": [
        "Successfully guided teams in implementing Adobe Flex for new projects and modernizing existing applications.",
        "Streamlined development workflows by introducing best practices for Flex development.",
        "Improved codebase quality and long-term maintainability through strategic refactoring initiatives."
      ],
      "contributions": [
        "Played a pivotal role in leading the successful adoption and implementation of the Adobe Flex framework across projects.",
        "Orchestrated and executed extensive code refactoring, transitioning substantial portions of the codebase from Adobe Flash ActionScript 3.0 to Adobe Flex 4.0, resulting in enhanced efficiency and maintainability.",
        "Contributed to establishing best practices for Flex development within the team, improving overall project quality and developer productivity."
      ],
      "skills": [
        "Software as a Service (SaaS)",
        "Attention to Detail",
        "REST APIs",
        "User Interface Design",
        "ActionScript",
        "HTML",
        "Flex",
        "JavaScript",
        "Web Applications",
        "Adobe Creative Suite",
        "Problem Solving",
        "UIX",
        "Complex Systems",
        "CSS"
      ]
    },
    {
      "title": "Sr.Flash / AS3 Developer",
      "company": "ProKarma",
      "duration": "Sep 2011 - Jul 2012",
      "challenges": [
        "Seamlessly embedding the casino-style slot machine game 'House of Fun' (later acquired by Playtika) onto the Facebook platform.",
        "Implementing robust social sharing functionalities to encourage player engagement and virality on Facebook.",
        "Developing a reliable system for saving and displaying player scores and rankings among friends on Facebook.",
        "Effectively utilizing Facebook's marketing tools to promote the game and acquire new players within the platform."
      ],
      "solutions": [
        "Leveraged the Facebook API extensively to embed the game directly on Facebook, ensuring a seamless user experience.",
        "Developed features that tapped into Facebook's social network, facilitating easy sharing, friend invitations, and score comparisons.",
        "Created a robust system for saving player data and displaying friend rankings using the Facebook API.",
        "Integrated Facebook's marketing APIs to execute targeted ads and promotions directly within the platform, optimizing user acquisition."
      ],
      "contributions": [
        "Developed and integrated key features using the Facebook API, specifically embedding the game to ensure optimal performance on the platform.",
        "Played a significant role in creating and optimizing social sharing tools, enabling players to invite friends and showcase achievements effortlessly.",
        "Designed and set up the system for accurately saving player scores and rankings, ensuring visibility among friends and enhancing competitive play.",
        "Assisted in integrating Facebook's marketing APIs to support successful game promotions and user acquisition strategies."
      ],
      "skills": [
        "Software as a Service (SaaS)",
        "Attention to Detail",
        "REST APIs",
        "User Interface Design",
        "Web Applications",
        "Adobe Creative Suite",
        "Problem Solving",
        "UIX",
        "Complex Systems",
        "Agile Development"
      ]
    },
    {
      "title": "Technical Lead | Scrum Master",
      "company": "Creata",
      "duration": "Aug 2010 - May 2011",
      "challenges": [
        "Leading web development projects for McDonald's websites, focusing on enhancing their online presence and customer experience.",
        "Overseeing the implementation of McDonald's websites in Latin America, expanding the brand's digital footprint into new markets.",
        "Integrating new features, such as a restaurant locator with the Google Maps API, to improve user accessibility and provide valuable customer tools."
      ],
      "solutions": [
        "Implemented Agile Scrum methodologies to manage and deliver web development projects efficiently.",
        "Successfully expanded McDonald's digital presence by launching localized websites across Latin America.",
        "Integrated advanced functionalities like the Google Maps API for enhanced user interaction and utility."
      ],
      "contributions": [
        "Contributed significantly to web development projects for McDonald's websites, playing a pivotal role in creating and maintaining digital solutions that enhanced online presence and customer experience.",
        "Led the successful implementation of McDonald's websites in Latin America, effectively expanding the brand's digital footprint into new markets.",
        "Successfully integrated new features, including a sophisticated restaurant locator powered by the Google Maps API, which significantly enhanced user accessibility and provided a valuable tool for customers seeking nearby locations."
      ],
      "skills": [
        "Agile Software Development",
        "Attention to Detail",
        "REST APIs",
        "User Interface Design",
        "XML",
        "HTML5",
        "SQL",
        "ActionScript",
        "HTML",
        "JavaScript",
        "Web Applications",
        "Adobe Creative Suite",
        "Google Maps",
        "Leadership",
        "Problem Solving",
        "Agile Environment",
        "Complex Systems",
        "CSS3",
        "Adobe Flash",
        "Agile Development",
        "CSS"
      ]
    },
    {
      "title": "WAP R&D PHP Senior Developer",
      "company": "Gameloft",
      "duration": "Jul 2008 - Sep 2010",
      "challenges": [
        "Collaborating within the Research & Development team to build templates and research new functionalities within the WAP framework.",
        "Providing support and guidance to the production team for effective implementation of new innovations.",
        "Extensive development and support for promotional microsites for major mobile operators in the LATAM market (Movistar, Claro, Tigo, Personal, OI, TIM, etc.).",
        "Ensuring mobile-first design and compatibility across various WAP-enabled devices."
      ],
      "solutions": [
        "Developed robust WAP templates and conducted R&D for new features, ensuring cutting-edge mobile content delivery.",
        "Provided critical technical support to the production team, facilitating seamless integration of new functionalities.",
        "Built and maintained numerous promotional microsites, effectively expanding market outreach and customer engagement for mobile operators."
      ],
      "contributions": [
        "Collaborated within the Research & Development team, playing a key role in building foundational templates and conducting extensive research to explore and implement new functionalities within the WAP framework.",
        "Provided invaluable support and guidance to the production team in applying these innovations effectively, ensuring smooth deployment of new features.",
        "Provided extensive development and support for promotional microsites tailored for mobile operators in the LATAM market, including major players like Movistar, Claro, Tigo (America Movil), Personal, OI, TIM, and more. This role involved creating and maintaining dynamic web-based platforms to promote mobile services, significantly contributing to market outreach and customer engagement strategies."
      ],
      "skills": [
        "PHP",
        "Attention to Detail",
        "MySQL",
        "Mobile Application Development",
        "REST APIs",
        "SQL",
        "ActionScript",
        "HTML",
        "JavaScript",
        "Web Applications",
        "Vanilla JavaScript",
        "Responsive Web Design",
        "Problem Solving",
        "Complex Systems",
        "Continuous Integration (CI)",
        "Application Programming Interfaces (API)",
        "CSS"
      ]
    },
    {
      "title": "Actionscript 3.0 Developer",
      "company": "Gameloft",
      "duration": "Jan 2007 - Jul 2008",
      "challenges": [
        "Supporting the integration of casual games published on Facebook, requiring robust communication protocols.",
        "Analyzing and developing the communication protocol (XML, JSON, AMFPHP) between the game framework and the Facebook API.",
        "Ensuring seamless functionality and data exchange between game applications and the Facebook platform."
      ],
      "solutions": [
        "Developed and optimized communication protocols (XML, JSON, AMFPHP) to ensure seamless integration between games and the Facebook API.",
        "Provided critical support for the successful publication and functionality of casual games on the Facebook platform."
      ],
      "contributions": [
        "Assisted in the support and integration of various casual games successfully published on Facebook.",
        "Analyzed and developed sophisticated communication protocols (XML, JSON, AMFPHP) to ensure seamless data exchange and functionality between the core game framework and the Facebook API.",
        "Contributed to the overall stability and performance of games operating within the Facebook ecosystem."
      ],
      "skills": [
        "PHP",
        "Attention to Detail",
        "MySQL",
        "REST APIs",
        "User Interface Design",
        "SQL",
        "ActionScript",
        "HTML",
        "JavaScript",
        "Web Applications",
        "Adobe Creative Suite",
        "Problem Solving",
        "UIX",
        "Complex Systems",
        "Continuous Integration (CI)",
        "CSS"
      ]
    },
    {
      "title": "IHTML jr. Web Developer",
      "company": "Brightstar Corp.",
      "duration": "Feb 2005 - Feb 2006",
      "challenges": [
        "Building complex e-commerce websites with a primary focus on Business-to-Business (B2B) platforms.",
        "Creating and maintaining secure, private channels for resellers to facilitate product commercialization.",
        "Ensuring robust functionality for ordering, inventory management, and secure transactions within the B2B framework."
      ],
      "solutions": [
        "Developed robust B2B e-commerce platforms to support Brightstar Corp.'s digital commerce initiatives.",
        "Implemented secure private channels for resellers, streamlining product commercialization processes.",
        "Ensured effective functionality for complex ordering and inventory management within the B2B ecosystem."
      ],
      "contributions": [
        "Built comprehensive e-commerce websites, with a primary focus on Business-to-Business (B2B) platforms, significantly contributing to the online presence and digital commerce of the organization.",
        "Created and diligently maintained private channels for resellers, effectively facilitating seamless interactions and enabling them to efficiently commercialize products from Brightstar Corp. directly through the platform."
      ],
      "skills": [
        "Software as a Service (SaaS)",
        "Attention to Detail",
        "DHTML",
        "ihtml",
        "REST APIs",
        "SQL",
        "HTML",
        "JavaScript",
        "Web Applications",
        "Vanilla JavaScript",
        "Problem Solving",
        "Complex Systems",
        "CSS3",
        "Business-to-Business (B2B)",
        "Application Programming Interfaces (API)"
      ]
    }
  ],
  "educations": [
    {
      "degree": "Associate Degree in Information Systems Management, specializing in Computer Programming",
      "institution": "Cotemig",
      "duration": "2002 - 2005"
    },
    {
      "degree": "HTML5, Tecnología de la información",
      "institution": "ITMaster",
      "duration": "2013 - 2013"
    },
    {
      "degree": "Eng. Software, Incomplete Degree",
      "institution": "Centro Universitário UNA",
      "duration": "2004 - 2005"
    }
  ]
}