{
  "workExperiences": [
    {
      "title": "Sr. Software Engineer",
      "company": "Liberty Mutual Insurance",
      "duration": "Jun 2022 - Jun 2024",
      "logo": "./assets/lm-logo.webp",
      "challenges": "Liberty Mutual is a large company with various departments, and each department or project has implemented its own business logic and technology stack. In one project, you might find a React implementation, while another could use Angular. You could also come across Vue.js or even plain Vanilla JavaScript. <br/><br /> Over time, the look and feel (the UI implementation) have evolved, leading to inconsistencies. The challenge is that Liberty Mutual’s brand identity, including its UI, has also evolved and changed over time, creating further discrepancies.",
      "solutions": "Liberty Mutual needed a solution to manage all its brand identity in one centralized place. To achieve this, they created an in-house UI library to be used company-wide. This library was built using web component technology, which is agnostic and native, allowing it to be supported across any framework or technology, such as React, Angular, Vue, or plain JavaScript.",
      "contributions": "As a Senior Software Engineer, I designed and built several web components for this UI library. One of the components I’m most proud of is the stepper component, which has become one of the most widely used across projects.",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "StencilJS",
        "Vue",
        "Angular",
        "React",
        "Node",
        "Material-UI",
        "Tailwind",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "Kanban",
        "Web Components",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Avaya",
      "duration": "Jun 2021 - May 2022",
      "challenges": "Build a new Avaya design system. Initially, this project began as a CSS file with custom styles, which was widely adopted across company projects. However, this solution proved impractical because it lacked HTML implementation. For example, a major challenge was creating HTML that adhered to the Web Content Accessibility Guidelines (WCAG) set by the World Wide Web Consortium (W3C). These guidelines outline best practices for color contrast, heading structures, clear link text, and the proper use of ARIA attributes to enhance screen reader functionality.<br><br> Without a structured approach, developers struggled to implement and test these accessibility requirements in their projects. This not only increased development time but also diverted focus away from working on core business logic.",
      "solutions": "Developed a React-based UI component library that incorporates accessibility standards (A11Y). This approach enables developers to speed up the development process while ensuring compliance with accessibility guidelines.",
      "contributions": "As a Senior Software Engineer, I designed and built several components for this UI library.",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",

        "React",
        "Node",
        "Material-UI",
        "Tailwind",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",

        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Leuchter IT Solutions",
      "duration": "Jun 2020 - May 2021",
      "challenges": "At Leuchter, the project focused on developing a real estate and financing website for Swiss citizens. The platform aimed to provide a loan financing calculator to help users estimate the costs of purchasing a house.<br><br> To get a loan approved, the system required users to complete a detailed application form and upload several documents for review by the financial institution. Additionally, users needed to provide the zip code of the canton where the desired property was located.",
      "solutions": "The team implemented the project using Material UI for the front end, combined with C# .NET and MSSQL for the back end. The website was fully responsive, ensuring seamless compatibility across various screen sizes and device resolutions. To accommodate Switzerland's multilingual population, the website supported four languages: English, German, Italian, and French.",
      "contributions": "I was responsible for adding new features to the project, developing the financial calculator based on design specifications, and integrating a Swiss API to retrieve zip codes based on the selected address.",
      "skills": [
        "C#",
        ".Net",
        "SQL",
        "MS-SQL-Server",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Software Engineer",
      "company": "Joinder",
      "duration": "Jan 2020 - Jun 2020",
      "challenges": "At Orrick, a law firm needed a new way to manage their legal documents, a solution that didn’t yet exist in the market. To address this, they developed Joinder, a custom cloud-based system designed specifically for managing legal documents.",
      "solutions": "The Joinder team developed a software application using Electron (cross-platform desktop applications), combined with Material UI for the frontend design and C# .NET for the backend infrastructure.",
      "contributions": "One key requirement was to enable automatic document saving while editing, eliminating the need for users to manually click the save button. Leveraging Electron’s file system privileges, I implemented a feature that detected changes in the document and automatically uploaded the updated version to the cloud without interrupting the user.",
      "skills": [
        "C#",
        ".Net",
        "Electron",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Pura",
      "duration": "Jan 2018 - May 2019",
      "challenges": "During my time at Pura, a startup that graduated from the UVU Startup Accelerator program, I encountered several challenges common to early-stage companies.",
      "solutions": "To establish their online presence, they built their e-commerce website using Shopify. For additional functionality and scalability, they leveraged React and Material-UI for the frontend, along with Firebase (part of the Google for Startups program) for backend services.",
      "contributions": "I played a key role in modifying their subscription model. Initially, the first checkout required customers to purchase a device along with two fragrances. Subsequent charges were supposed to be for the subscription program, which included two fragrances per month. However, the system had an issue where the device was being incorrectly included in recurring subscription charges. My contribution involved fixing this issue to ensure the device was only charged once during the initial purchase, while subsequent charges were solely for the subscription program (a minimum of two fragrances per month).<br><br> Additionally, they were facing another issue with the shopping cart on mobile devices. Users could rearrange the fragrance list order using a drag-and-drop interface, but the user actions were often faster than the server's response time. This mismatch created inconsistencies between the order displayed to the user and the order saved on the server. To resolve this, I implemented an Optimistic UI approach. This ensured that the frontend immediately reflected the user's changes while the server processed the updates in the background, significantly improving the user experience.",
      "skills": [
        "Firebase",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "Agile",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    },
    {
      "title": "Sr. Frontend Developer",
      "company": "Infinity ELS",
      "duration": "Jan 2017 - Apr 2018",
      "challenges": "They were modernizing their tech stack by building a new UI for their internal tool, which was used to manage customer information and billing details.",
      "solutions": "The solution involved migrating from jQuery to React with Material UI for a more modern and maintainable frontend.",
      "contributions": "Initially, they had mixed jQuery with React, which was a poor practice. This mistake occurred because a junior developer was tasked with the implementation. The combination of both frameworks led to inconsistencies in DOM manipulation, creating issues in the project.<br><br>To resolve this, I first modified the jQuery library to address the immediate problems. Later, I led the effort to remove all jQuery implementations entirely and fully migrate the project to React, ensuring a cleaner and more efficient codebase.",
      "skills": [
        "jQuery",
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Node",
        "Material-UI",
        "GitHub",
        "Git",
        "UI/UX",
        "JIRA",
        "Product Development",
        "Communication"
      ]
    }
  ],
  "educations": [
    {
      "degree": "Associate Degree in Information Systems Management, specializing in Computer Programming",
      "institution": "Cotemig",
      "duration": "2002 - 2005"
    }
  ]
}
